Revit 2027 API
VectorAtPoint(IList<XYZ>) Constructor
 Creates object from an array of vectors
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VectorAtPoint(
	IList<XYZ> vectors
)
Public Sub New (
	vectors As IList(Of XYZ)
)
public:
VectorAtPoint(
	IList<XYZ^>^ vectors
)
new :
        vectors : IList<XYZ> -> VectorAtPoint
Parameters
vectors IList<XYZ>
 Array of vectors, each corresponding to "measurement"
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied vectors contain invalid (infinite or non-number) coordinates
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VectorAtPoint Class
VectorAtPoint Overload
Autodesk.Revit.DB.Analysis Namespace